dehphos/FOC-motor-controller-with-stm32f303ret6/Core/Inc/main.h
    if (cos_index >= 360U)
        cos_index -= 360U;

    *sin_val = sin_lut[angle_deg];
    *cos_val = sin_lut[cos_index];
}



/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/

/* USER CODE BEGIN Private defines */

/** @brief \f\f$1/\sqrt{3}\f\f$ sabiti (3-Faz Clarke Dönüşüm Katsayısı). */
#define ONE_BY_SQRT3 0.577350269f
/** @brief \f\f$2/\sqrt{3}\f\f$ sabiti (SVPWM ve Clarke Dönüşüm Katsayısı). */
#define TWO_BY_SQRT3 1.154700538f
/** @brief \f\f$\sqrt{3}/2\f\f$ sabiti (Ters Clarke Dönüşüm Katsayısı). */
#define SQRT3_BY_2   0.866025403f
/** @brief Pi sayısı (Açısal Hız/Radyan hesaplamaları için). */
#define PI 3.14159265359f

#define ONE_BY_PI 0.31830988618f

#define PI_BY_TWO   1.57079632f

/** @brief Donanım Şönt direnci ve Op-Amp kazancına göre okunan maksimum akım sınırı [A]. */


/** @brief TIM3 Input Capture zamanlayıcısının ana osilatör frekansı [Hz]. */
#define TIM3_CLK_HZ       72000000UL
/** @brief TIM3 zamanlayıcısı prescaler (ön bölücü) değeri. */
#define TIM3_PRESCALER       143UL
/** @brief TIM3 zamanlayıcısının çalışma periyodu (Çözünürlük) [Hz]. */
#define TIM3_CNT_HZ          (TIM3_CLK_HZ / TIM3_PRESCALER)

/** @brief Genel hız/akım tarama testini (test.c) etkinleştirir. */
#define TEST true
/** @brief D-Q akım PI kazanç Oto-Tuning testini (test_dq.c) etkinleştirir. */
#define DQ_TEST false
/** @brief Hız PI kazanç Oto-Tuning testini (test_spd.c) etkinleştirir. */
#define SPEED_TEST false
/** @brief Donanım olmadan sanal motor simülasyonunu etkinleştirir (Sadece yazılım testi). */
#define SIMULATE_MOTOR false

/** @brief Gerçek zamanlı rotor açısının DAC kanallarından osiloskoba aktarılmasını açar. */
#define DAC_OUT false

/** @brief Standart Üçgen dalga (Sinüzoidal) PWM modülasyonu. */
#define PWM_OUT false

/** @brief Uzay Vektörü (Space Vector - SVPWM) modülasyonu (%15 bara kazancı sağlar). */
#define SVPWM_OUT true

#if PWM_OUT && SVPWM_OUT
	#error PWM OUTPUT CONFIG ERROR: Hem klasik PWM hem SVPWM ayni anda secilemez!
#endif
#if (TEST && DQ_TEST) || (TEST && SPEED_TEST) || (DQ_TEST && SPEED_TEST)
	#error TEST CONFIG ERROR: Ayni anda yalnizca bir Oto-Tuning testi aktif edilebilir!
#endif
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
